#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
digitalocean_droplet.server: Refreshing state... [id=248756770]
digitalocean_floating_ip_assignment.app-dreiseenstafette-ch-assignment: Refreshing state... [id=248756770-67.207.79.200-20210602215000604200000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.server must be replaced
-/+ resource "digitalocean_droplet" "server" {
      ~ created_at           = "2021-06-02T21:49:18Z" -> (known after apply)
      ~ disk                 = 25 -> (known after apply)
      ~ id                   = "248756770" -> (known after apply)
      ~ image                = "ubuntu-18-04-x64" -> "85289905" # forces replacement
      ~ ipv4_address         = "46.101.129.207" -> (known after apply)
      ~ ipv4_address_private = "10.114.0.3" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 1024 -> (known after apply)
        name                 = "server"
      ~ price_hourly         = 0.00744 -> (known after apply)
      ~ price_monthly        = 5 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:248756770" -> (known after apply)
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "dfb3c56d-37ac-400e-951e-e02620f5feae" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # digitalocean_floating_ip_assignment.app-dreiseenstafette-ch-assignment must be replaced
-/+ resource "digitalocean_floating_ip_assignment" "app-dreiseenstafette-ch-assignment" {
      ~ droplet_id = 248756770 -> (known after apply) # forces replacement
      ~ id         = "248756770-67.207.79.200-20210602215000604200000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @joergmis, Action: `pull_request`*